src/Catalogs/ТекущееЧислоВызововСервера/ТекущееЧислоВызововСервера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТекущееЧислоВызововСервера</name>
  <owners>Catalog.ПоказателиМониторинга</owners>
  <owners>Catalog.ПоказателиОповещений</owners>
  <owners>Catalog.ПоказателиИнцидентов</owners>
  <attributes>
    <name>АвтоМасштаб</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВременноеСмещение</name>
    <type>
      <types>EnumRef.ВариантыСмещенияВременногоОкна</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеКластеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменилосьСглаживание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменился</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменилсяВид</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кластер</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТипаПоказателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьДанныеЗаПрошлыйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТренд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСглаживания</name>
    <type>
      <types>EnumRef.ТипыСглаживания</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнформационныеБазы</name>
    <attributes>
      <name>ИнформационнаяБазаСсылка</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ПараметрыКластеров/ПараметрыКластеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыКластеров</name>
  <resources>
    <name>ТипПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресСервераАдминистрирования</name>
    <comment>// Только для &quot;RAS&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортСервераАдминистрирования</name>
    <comment>// Только для &quot;RAS&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогЗапускаСервераАдминистрирования</name>
    <comment>// Только для &quot;RAС&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортАгентаКластера</name>
    <comment>ПортАгентаСервера Только для &quot;COM&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КластерОбъектаКонтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортКластера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформы</types>
    </type>
  </resources>
  <resources>
    <name>ИмяКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПерезапускаРабочихПроцессов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимыйОбъемПамяти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалДопустимогоПревышенияОбъемаПамяти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоеОтклонениеОшибокСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПринудительноЗавершатьПроблемныеПроцессы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыключенныеПроцессыОстанавливатьЧерез</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньОтказоустойчивости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РежимРаспределенияНагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мониторинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВидыОбъектовКонтроля</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ТекущееЧислоВызововСервера/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Выборка = Общий.ВыборкаКластеров();
	ПервыйКластер = Истина;
	Пока Выборка.Следующий() Цикл
		
		Кластер = Выборка.Ссылка;
		Элементы.Кластер.СписокВыбора.Добавить(Кластер);
		
	КонецЦикла;
	
	Если Объект.Ссылка.Пустая() И Элементы.Кластер.СписокВыбора.Количество() > 0 Тогда
		
		Кластер = Элементы.Кластер.СписокВыбора[0].Значение;
		Объект.Кластер = Кластер;
		Объект.ВсеКластеры = Истина;
		
	КонецЕсли;
	
	НастроитьСписокИнформационныхБаз(ЗначениеЗаполнено(Объект.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьВидимостьКластеров();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ИнформационныеБазы.Очистить();
	Для Каждого СтрокаБазы Из СписокИнформационныхБаз Цикл
		Если СтрокаБазы.Выбрано Тогда
			СтрокаОбъекта = ТекущийОбъект.ИнформационныеБазы.Добавить();
			СтрокаОбъекта.ИнформационнаяБазаСсылка = СтрокаБазы.ИнформационнаяБаза;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрОповещения = МониторингСервер.ПараметрОповещенияПоказательЗаписан(ТекущийОбъект);
	ПараметрОповещения.Изменился = ОбъектИзменился();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрОповещения.Ссылка = Объект.Ссылка;
	ПараметрОповещения.Описание = Объект.Описание;
	Оповестить("ПоказательЗаписан", ПараметрОповещения, ЭтотОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура КластерПриИзменении(Элемент)
	НастроитьСписокИнформационныхБаз();
КонецПроцедуры

&НаКлиенте
Процедура ВсеКластерыПриИзменении(Элемент)
	НастроитьВидимостьКластеров();
	НастроитьСписокИнформационныхБаз();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СписокИнформационныхБаз

&НаКлиенте
Процедура ВыбратьВсеБазы(Команда)
	ВыбратьВсеБазыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыборВсехБаз(Команда)
	ВыбратьВсеБазыСервер(Ложь);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура НастроитьВидимостьКластеров()
	ПоказыватьПоВсемКластерам = Объект.ВсеКластеры;
	Элементы.Кластер.Видимость = НЕ ПоказыватьПоВсемКластерам;
КонецПроцедуры

&НаСервере
Функция ОбъектИзменился()
	
	ИнформационныеБазыСсылка = Объект.Ссылка.ИнформационныеБазы;
	ВыбранныеБазы = ВыбранныеБазы();
	
	Если ВыбранныеБазы.Количество() <> ИнформационныеБазыСсылка.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого СтрокаБазы Из ИнформационныеБазыСсылка Цикл
		
		Если ВыбранныеБазы.Найти(СтрокаБазы.ИнформационнаяБазаСсылка) = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ВыбратьВсеБазыСервер(ЗначениеВыбора = Истина)
	ЧислоСтрок = СписокИнформационныхБаз.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < ЧислоСтрок Цикл
		СтрокаБазы = СписокИнформационныхБаз[ИндексСтроки];
		СтрокаБазы.Выбрано = ЗначениеВыбора;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	ОбновитьСтроковоеПредставлениеБаз();
КонецПроцедуры

&НаКлиенте
Процедура СписокИнформационныхБазВыбраноПриИзменении(Элемент)
	ОбновитьСтроковоеПредставлениеБаз();
КонецПроцедуры

&НаСервере
Функция ВыбранныеБазы()
	Результат = Новый Массив;
	ЧислоСтрок = СписокИнформационныхБаз.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < ЧислоСтрок Цикл
		СтрокаБазы = СписокИнформационныхБаз[ИндексСтроки];
		Если СтрокаБазы.Выбрано Тогда
			Результат.Добавить(СтрокаБазы.ИнформационнаяБаза);
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура НастроитьСписокИнформационныхБаз(СинхронизоватьВыбранныеИСохраненныеЗначения = Ложь)
	
	ИнформационныеБазыВСтроку = "";
	СписокИнформационныхБаз.Очистить();
	
	Если НЕ Объект.ВсеКластеры И Объект.Кластер.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидИнформационнаяБаза", Справочники.ВидыОбъектовКонтроля.ИнформационнаяБаза);
	ЗапросТекст = "ВЫБРАТЬ
	|	Базы.ОбъектКонтроля КАК База,
	|	Кластеры.ОбъектКонтроля КАК Кластер
	|ИЗ
	|	РегистрСведений.ПараметрыИнформационныхБаз КАК Базы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКластеров КАК Кластеры
	|		ПО Базы.Кластер = Кластеры.ОбъектКонтроля
	|ГДЕ
	|	Базы.ОбъектКонтроля.Владелец = &ВидИнформационнаяБаза %УсловиеНаКластер";
	
	Если НЕ Объект.ВсеКластеры И НЕ Объект.Кластер.Пустая() Тогда
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "%УсловиеНаКластер", " И  Кластеры.ОбъектКонтроля = &Кластер ");
		Запрос.УстановитьПараметр("Кластер", Объект.Кластер);
	Иначе
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "%УсловиеНаКластер", "");
	КонецЕсли;
	
	Запрос.Текст = ЗапросТекст;
	БазыВыборка = Запрос.Выполнить().Выбрать();
	
	ТекущиеБазыСсылка = Объект.ИнформационныеБазы;
	
	Пока БазыВыборка.Следующий() Цикл
		
		СтрокаБазы = СписокИнформационныхБаз.Добавить();
		БазаВыборки = БазыВыборка.База;
		КластерВыборки = БазыВыборка.Кластер;
		
		Если СинхронизоватьВыбранныеИСохраненныеЗначения Тогда
			ВыбранныеСтроки = ТекущиеБазыСсылка.НайтиСтроки(Новый Структура("ИнформационнаяБазаСсылка", БазаВыборки));
			Если ВыбранныеСтроки.Количество() > 0 Тогда
				СтрокаБазы.Выбрано = Истина;
				ИнформационныеБазыВСтроку = ИнформационныеБазыВСтроку + ";"
			КонецЕсли;
		Иначе
			СтрокаБазы.Выбрано = Истина;
		КонецЕсли;
		
		СтрокаБазы.ИнформационнаяБаза = БазаВыборки;
		СтрокаБазы.Кластер = КластерВыборки;
		
	КонецЦикла;
	ОбновитьСтроковоеПредставлениеБаз();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтроковоеПредставлениеБаз()
	ИнформационныеБазыВСтроку = "";
	ЧислоСтрок = СписокИнформационныхБаз.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < ЧислоСтрок Цикл
		СтрокаБазы = СписокИнформационныхБаз[ИндексСтроки];
		Если СтрокаБазы.Выбрано Тогда
			ИнформационныеБазыВСтроку = ИнформационныеБазыВСтроку + ";" + СтрокаБазы.ИнформационнаяБаза + ", " + СтрокаБазы.Кластер;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Если НЕ ПустаяСтрока(ИнформационныеБазыВСтроку) Тогда
		ИнформационныеБазыВСтроку = Прав(ИнформационныеБазыВСтроку, СтрДлина(ИнформационныеБазыВСтроку) - 1);
	КонецЕсли;
КонецПроцедуры
